{
  "users": [
    {
      "login": "sergei",
      "password": "qwerty123",
      "registered_at": "2024-02-11",
      "role_id": 0,
      "id": "0000001"
    },
    {
      "login": "ivan",
      "password": "qwerty123",
      "registered_at": "2042-11-26 21:50",
      "role_id": 1,
      "id": "CRevsbu"
    },
    {
      "login": "vasya",
      "password": "qwerty123",
      "registered_at": "2034-05-25 08:55",
      "role_id": 2,
      "id": "CX-Pyvh"
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Администратор"
    },
    {
      "id": "1",
      "name": "Модератор"
    },
    {
      "id": "2",
      "name": "Читатель"
    },
    {
      "id": "3",
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Прогулка по Мирскому замку",
      "image_url": "https://bytepix.ru/ib/XTPhXq9h88.jpg",
      "content": "Мирский замок - одна из главных достопримечательностей Беларуси <br> Он не нуждается в представлении. К Мирскому замку никогда не зарастает народная тропа. Возле замкового комплекса всегда много автобусов с туристами, школьниками и зарубежными делегациями высочайшего уровня. Беларусь по праву гордится Мирским замком, ибо он пополняет престижный список ЮНЕСКО и известен за границей как прекрасный образец оборонного сооружения XVI века, через долгие столетия дошедшего до наших дней. <br> Замковый комплекс находится в небольшом живописном поселке Мир на Гродненщине, где его можно наблюдать со всех сторон - настолько это монументальное и величественное сооружение. В далеком XVI веке фундамент замка заложил еще князь Илинич, однако чуть позже замок оказался среди владений известнейшего рода Радзивиллов, внесших в его строительство некоторые коррективы с добавлением щепотки непревзойденного ренессанса. <br> Мирский замок получился выше всяких похвал: величественное здание в три этажа высотой, выкопанный ров с водой, массивные валы с бастионами, пейзажный парк в итальянской стилистике и даже искусственно созданное озерцо. Мирский замок был выстроен из камня и кирпича, на многих стройматериалах осталась авторская отметка. Планировка замка отсылает к четырехугольнику, близкому к квадрату. На замок в первую очередь возлагалась функция обороны от вражеских набегов, поэтому его массивные стены имели несколько бойничных рядов, а башни были предназначены для того, чтобы стрелять. На территории замка имелся в наличии даже такой диковинный экземпляр, как специальное устройство для поднятия оружия на верхние этажи. По углам замка размещались четыре выступающие башни, а пятая использовалась для въезда и обозрения прилегающей территории. <br> Однако замку была уготована не самая завидная судьба: во время войны с Наполеоном Бонапартом замковый комплекс в Мире существенно пострадал и долгое время пребывал в запустении. Все еще находясь у зажиточных Радзивиллов во владении, замок вскоре был восстановлен и продан. Так он попал к Святополку-Мирскому, сын которого продолжил восстановительные работы. В период Великой Отечественной войны в замке расположилось гетто, а в послевоенное время здесь ютились местные жители, у которых война отобрала недвижимость.",
      "published_at": "2024-02-11"
    },
    {
      "id": "002",
      "title": "Поездка в райское местечко",
      "image_url": "https://bytepix.ru/ib/DJLFng8ole.jpg",
      "content": "Доминиканская Республика - это потрясающее место, расположенное в Карибском море, которое славится своими белоснежными пляжами, лазурными водами и роскошными курортами. Эта страна является популярным направлением для туристов со всего мира, особенно для тех, кто ищет тропический рай для своего отпуска. <br> Доминиканская Республика известна своими историческими городами, такими как Розо, где можно увидеть прекрасные колониальные здания и прогуляться по мощеным улочкам. Еще одним популярным туристическим направлением является столица республики, Розо, известная своими музеями, галереями и ресторанами. <br> Помимо великолепных пляжей и исторических городов, Доминиканская Республика также славится своей богатой культурой и традициями. Здесь можно познакомиться с местным искусством, музыкой и танцами, а также попробовать традиционные блюда, такие как “санкочо” - густой суп с мясом и овощами. <br> Наконец, стоит отметить, что Доминиканская Республика предлагает широкий выбор курортов и отелей на любой вкус и бюджет. Здесь есть как роскошные пятизвездочные отели, так и более бюджетные варианты для тех, кто хочет насладиться местным колоритом без больших затрат.",
      "published_at": "2024-02-12"
    },
    {
      "id": "003",
      "title": "Работаем и гуляем в Питере",
      "image_url": "https://bytepix.ru/ib/ac2bguMXEL.jpg",
      "content": "Санкт-Петербург - один из самых красивых городов мира, известный своими великолепными дворцами, парками и музеями. <br> Прогулка по Невскому проспекту - это незабываемое впечатление, где каждый дом имеет свою историю и архитектуру. <br> Одним из самых популярных мест в Санкт-Петербурге является Эрмитаж - крупнейший музей мира, расположенный в Зимнем дворце. Коллекция музея насчитывает более 3 миллионов экспонатов, включая картины, скульптуры, оружие и многое другое. <br> Кроме того, Санкт-Петербург славится своими белыми ночами - периодом, когда солнце не заходит за горизонт, что создает неповторимую атмосферу и позволяет наслаждаться городом в ночное время. <br> Однако, Санкт-Петербург - это не только культурная столица России, но и важный экономический и образовательный центр. Здесь расположены ведущие университеты страны, такие как Санкт-Петербургский государственный университет и Политехнический университет.",
      "published_at": "2024-02-13"
    },
    {
      "id": "004",
      "title": "Встретился в Сочи с крутыми ребятами",
      "image_url": "https://bytepix.ru/ib/Oz0zc5ay5D.jpg",
      "content": "Формула 1 в Сочи - одно из самых захватывающих событий, которое привлекает внимание миллионов зрителей со всего мира. Гран-при России проходит на трассе “Сочи Автодром”, которая была открыта в 2014 году и с тех пор стала домом для этого яркого и зрелищного мероприятия. В рамках Гран-при проходят соревнования среди лучших пилотов мира, которые борются за победу в самых престижных гонках. <br> Ночное событие, проходящее параллельно с гонками, это ежегодный забег “Ночной забег”, который собирает участников со всей России и стран ближнего зарубежья. Этот забег проводится в темное время суток, что придает ему особую атмосферу. Участники забега пробегают дистанцию от 5 до 21 км, в зависимости от своей подготовки и желания. Ночная трасса освещается множеством огней, что делает забег еще более зрелищным и незабываемым. <br> Оба события - Формула 1 и Ночной забег - проходят в атмосфере невероятного спортивного азарта и напряжения. Зрители и участники с нетерпением ждут начала соревнований, чтобы стать свидетелями захватывающих гонок и увлекательного забега. Каждый год организаторы стараются сделать эти мероприятия еще более яркими и запоминающимися, предлагая разнообразные развлечения и активности для всех присутствующих.",
      "published_at": "2024-02-14"
    },
    {
      "id": "005",
      "title": "Поездка в Дубай",
      "image_url": "https://bytepix.ru/ib/ybgtj2J7Ic.jpg",
      "content": "Поездка в Дубай - это настоящее путешествие в мир роскоши и богатства. Одним из самых известных и впечатляющих мест в этом городе является Бурдж Халифа - самое высокое здание в мире. Это небоскреб высотой 828 метров, который был построен в 2009-2010 годах и стал символом Дубая. <br> Бурдж Халифа состоит из 163 этажей, на которых располагаются роскошные апартаменты, офисные помещения, торговые центры и рестораны. На самом верхнем этаже находится смотровая площадка, откуда открывается потрясающий вид на весь Дубай. Посетители могут насладиться панорамными видами города, а также увидеть знаменитую искусственную Пальму Джумейра и другие достопримечательности. <br> Внутри здания также есть множество интересных объектов, таких как музыкальный фонтан, музей будущего и аквариум. Также здесь можно посетить отель “Армани” и бутик “Луи Виттон”. <br> Для того чтобы подняться на смотровую площадку, можно воспользоваться скоростными лифтами, которые доставят вас на высоту 555 метров всего за 1 минуту. Здесь можно насладиться не только видами города, но и почувствовать себя в невесомости благодаря панорамному остеклению и прозрачным полам.",
      "published_at": "2024-02-15"
    },
    {
      "id": "006",
      "title": "Мечеть шейха Зайда",
      "image_url": "https://bytepix.ru/ib/qy7CrdwysJ.jpg",
      "content": "Мечеть шейха Зайда в Абу-Даби - одна из самых красивых и величественных мечетей в мире. Она была построена в 1996 году в честь шейха Зайеда бин Султана Аль Нахьяна, основателя Объединенных Арабских Эмиратов. <br> Мечеть расположена на острове Саадият и ее архитектура сочетает в себе элементы исламского искусства и современных технологий. Здание мечети украшено белым мрамором, золотом и драгоценными камнями, а ее купол возвышается на 85 метров над землей. <br> Внутри мечети находятся 8 центральных колонн, каждая из которых украшена уникальной мозаикой. Также в мечети есть 4 минарета, каждый из которых имеет высоту 107 метров. <br> На территории мечети находится музей, где можно узнать о истории ислама и жизни шейха Зайеда. Также здесь есть парк, где можно прогуляться и насладиться красотой окружающей природы. <br> Посещение мечети шейха Зайеда - это не только возможность познакомиться с культурой и историей ОАЭ, но и насладиться красотой архитектуры и искусства.",
      "published_at": "2024-02-16"
    },
    {
      "id": "007",
      "title": "Рафтинг в Турции",
      "image_url": "https://bytepix.ru/ib/OCJpmpdoPJ.jpg",
      "content": "Рафтинг в Турции - это одно из самых популярных развлечений для туристов. Он предлагает возможность испытать адреналин и приключения, а также познакомиться с культурой и природой страны. <br> Рафтинг проводится на различных реках, таких как Арас, Кызылырмак и Сейхан. Каждая река имеет свои особенности и сложности, поэтому можно выбрать маршрут в зависимости от уровня подготовки. <br> Во время рафтинга туристы могут насладиться красивыми пейзажами, познакомиться с местными жителями и попробовать местную кухню. Также на маршрутах могут быть организованы остановки для купания, рыбалки и пикника. <br> Важно помнить, что рафтинг требует определенной подготовки и опыта, поэтому перед началом маршрута необходимо пройти инструктаж и соблюдать все правила безопасности. Также рекомендуется выбирать опытных гидов и снаряжение высокого качества. <br> В целом, рафтинг в Турции является отличным способом провести время, получить заряд адреналина и насладиться природой этой прекрасной страны.",
      "published_at": "2024-02-17"
    },
    {
      "id": "008",
      "title": "Окрестности Кисловодска",
      "image_url": "https://bytepix.ru/ib/IGcOBkobx6.jpg",
      "content": "Кисловодск - известный российский город-курорт, расположенный в Ставропольском крае. Он славится своими красивыми окрестностями, чистым горным воздухом и множеством достопримечательностей. Одной из них является гора Кольцо, которая находится недалеко от города и привлекает множество туристов. <br> Гора Кольцо - это природная достопримечательность, представляющая собой скалу с круглым отверстием посередине. Она получила свое название благодаря форме, напоминающей кольцо. Гора находится на высоте около 900 метров над уровнем моря и является частью Боргустанского хребта. <br> Вокруг горы Кольцо расположены живописные леса и луга, а с вершины открывается потрясающий вид на окрестности Кисловодска. Здесь можно увидеть горы Бештау, Машук и другие. Также на горе Кольцо есть несколько троп для прогулок и пикников. <br> Помимо горы Кольцо, в окрестностях Кисловодска есть и другие интересные места, такие как национальный парк “Кисловодский”, где можно увидеть множество видов растений и животных, а также посетить источники с минеральной водой. <br> Таким образом, окрестности Кисловодска - это прекрасное место для отдыха и изучения природы, а гора Кольцо является одной из главных достопримечательностей этого региона.",
      "published_at": "2024-02-18"
    },
    {
      "id": "009",
      "title": "Прокатились по Босфору",
      "image_url": "https://bytepix.ru/ib/MPZdjDRGnG.jpg",
      "content": "Стамбул - это город, который находится в двух частях света: Европе и Азии. Босфор - это пролив, который разделяет эти две части и соединяет Черное море с Мраморным. Босфор является одним из самых красивых мест в Стамбуле и привлекает множество туристов со всего мира.<br> Босфор имеет длину около 30 километров и ширину от 700 метров до 3,7 километров. Он является важным торговым путем и связывает Черное море с мировым океаном. На берегах пролива находятся множество исторических достопримечательностей, таких как дворец Топкапы, Голубая мечеть и собор Святой Софии. <br> Одним из самых популярных видов транспорта на Босфоре являются паромы, которые соединяют различные районы города. Также можно арендовать лодку или катер для прогулки по проливу. <br> Босфор - это не только красивое место для прогулок, но и символ Стамбула. Он отражает историю и культуру города, а также является местом, где соединяются разные культуры и народы.",
      "published_at": "2024-02-19"
    }
  ],
  "comments": [
    {
      "author_id": "0000001",
      "post_id": "001",
      "published_at": "2062-07-27 21:26",
      "content": "мой первый комментарий",
      "id": "1"
    },
    {
      "author_id": "0000001",
      "post_id": "001",
      "published_at": "2049-08-15 19:56",
      "content": "второй коммент",
      "id": "2"
    }
  ],
  "sessions": [
    {
      "hash": "0.71676827474270787821097883352194912731647491455078",
      "user": {
        "id": "0000001",
        "login": "sergei",
        "password": "qwerty123",
        "registeredAt": "2024-02-11",
        "roleId": 0
      },
      "id": "1"
    },
    {
      "hash": "0.86845435231900436345853222519508562982082366943359",
      "user": {
        "id": "0000001",
        "login": "sergei",
        "password": "qwerty123",
        "registeredAt": "2024-02-11",
        "roleId": 0
      },
      "id": "2"
    }
  ]
}